performance/artillery-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  
scenarios:
  - name: "Service Browser Flow"
    flow:
      - get:
          url: "/services"
      - think: 2
      - get:
          url: "/api/trpc/services.list?batch=1&input=%7B%220%22%3A%7B%22limit%22%3A24%2C%22featuredOnly%22%3Afalse%7D%7D"
      - think: 1
      
  - name: "Search and Filter Flow"
    flow:
      - get:
          url: "/services"
      - think: 1
      - get:
          url: "/api/trpc/services.list?batch=1&input=%7B%220%22%3A%7B%22limit%22%3A24%2C%22search%22%3A%22database%22%7D%7D"
      - think: 2
          
  - name: "Infinite Scroll"
    flow:
      - get:
          url: "/api/trpc/services.list?batch=1&input=%7B%220%22%3A%7B%22limit%22%3A24%7D%7D"
      - think: 1
      - get:
          url: "/api/trpc/services.list?batch=1&input=%7B%220%22%3A%7B%22limit%22%3A24%2C%22cursor%22%3A24%7D%7D"
      - think: 1
      - get:
          url: "/api/trpc/services.list?batch=1&input=%7B%220%22%3A%7B%22limit%22%3A24%2C%22cursor%22%3A48%7D%7D"